UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПеремещениеЗапасов/ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c63e7296-8bd5-4572-b1ca-d62e9d4681b3">
  <name>ПеремещениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктурнаяЕдиницаРеципиент</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСнабжения</name>
    <type>
      <types>DocumentRef.саУНФ_ЗаказСнабжения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2f9254d3-924b-4caf-b47a-628781e5adb8">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ed471c0-7303-4652-b434-1027727c5b67">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ea1fc21-bf58-41ff-9b62-421a3ffc846f">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f202ea25-5f08-454c-bcd4-d55a2675affb">
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93db1c83-ec44-4e17-a675-b53a1859d1b5">
    <name>ЯчейкаПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="739c93ad-81cc-401b-95f3-ec81b0e6ca07">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa5b33fe-cf43-49b9-b5ea-b7826671f562">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b99b4c3c-b6c9-4d5b-a573-3969efe6420f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6fcc9ac8-8471-48b7-a809-243a1da6d33e">
    <name>СчетЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89592531-f8c0-4bcf-b2f0-fc6a8387e335">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="743962e9-651e-42ac-9605-ee91b64795aa">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="259b7032-9476-4cfe-97a1-7a2faa232a3c">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9627732b-060e-4169-a38e-bd066c80b5bd">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>саУНФ_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ПАК_МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.ПАК_МаршрутныйЛист</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>саУНФ_СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКурьера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСборки</name>
    <type>
      <types>EnumRef.СостояниеСборки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузкиАвтомобиля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="bc903c70-92bd-4b1f-98b2-ad50b8bb044c">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПосторонний</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="2e1d10ce-4594-477f-ace1-dcad764157ce">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9c8e5c4e-d9b1-415a-8d9c-77359fe3b5f3">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c5cd63d4-614d-4f48-8364-002d2b3b99d3">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57001e53-e9c9-434b-8225-eaf7c072766b">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f890776d-32fc-4a55-888f-ab5f04372bb2">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0ab759b1-5453-423a-9808-dae7f0d62e7d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="594d5818-02d3-4902-811e-e8692cc12658">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8be5842e-e9d5-4f18-90f6-545c2288eb9c">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5866a844-b943-40f0-bdbe-1ccd88b0dec7">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="94f0835b-0bc7-40b5-af7a-b49634e874d8">
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93c6f638-bc15-47b7-9268-7d8a77d4ca28">
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="16492692-d666-4064-915d-c87d37cab732">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56d9e4e7-504d-473f-8b32-a333950aa29b">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="31b17715-fded-490d-bd7b-902d2aa45fc0">
    <name>ИнвентарьИХозяйственныеПринадлежности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b0376bce-8de0-4583-9d10-ca0a049ef9fa">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f0973ad-5d27-4511-9a5d-668155331f27">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c9f1c41-0aa7-481c-8675-67bc901f11eb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32a7d162-bb4a-4a5a-8904-ba89fe9e80c0">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8aa09fac-5d52-484f-b4ee-a5a2a0108c13">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f329d3fb-e7e1-4b98-a9f1-35c6e9481b66">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c0b7a0b-3fd8-41e2-88be-e39a8e868bf9">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2bb02e54-8fce-4430-ba51-da10d5ade522">
    <name>Спецоснастка</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="476c7825-8781-4c26-9466-89f22a8ecc43">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="94a5c934-c13d-428d-b932-5af199cb6b96">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e865d647-d7e8-49fa-87af-2bf990f1dcc2">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f1126107-3afe-4141-a667-d32f47152247">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="41873ec5-d568-4b6c-8906-2f1b46310515">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="490a4e3d-72fd-43ff-bc05-fdcc0f29cbf1">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3778f50d-bec4-44aa-aaa2-ab522191fdde">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/caУНФ_ТочкиДляАвтозаказа/caУНФ_ТочкиДляАвтозаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>caУНФ_ТочкиДляАвтозаказа</name>
  <resources>
    <name>Включить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтгружатьДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_НастройкаАвтозаказа/саУНФ_НастройкаАвтозаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_НастройкаАвтозаказа</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="26f5bd34-55fb-4583-a708-4a1aa18f4701">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="55a3f7e4-3de3-47d1-ae22-29cc117b567d">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78c63ce8-4298-4ddf-bdaa-d93bd267293a">
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb571f86-1462-437b-9ebb-1df93b741d6b">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СостояниеСборки/СостояниеСборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеСборки</name>
  <enumValues>
    <name>НеСобран</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Собирается</name>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПеремещениеЗапасов/ObjectModule.bsl
&Вместо("ОбработкаЗаполнения")
Процедура саУНФ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.АвансовыйОтчет")] = "ЗаполнитьПоАвансовомуОтчету";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказНаПроизводство")] = "ЗаполнитьПоЗаказуНаПроизводство";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеПоЯчейкам")] = "ЗаполнитьПоПеремещениюПоЯчейкам";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходнаяНакладная")] = "ЗаполнитьПоПриходнойНакладной";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
	СтратегияЗаполнения[Тип("ДокументСсылка.СборкаЗапасов")] = "ЗаполнитьПоСборкеЗапасов";
	СтратегияЗаполнения[Тип("ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС")] = "ЗаполнитьПоВходящейТранспортнойОперации";
	СтратегияЗаполнения[Тип("ДокументСсылка.ИсходящаяТранспортнаяОперацияВЕТИС")] = "ЗаполнитьПоИсходящейТранспортнойОперации";
	
	//***Начало***01.06.2021***МурашкоВ
	СтратегияЗаполнения[Тип("ДокументСсылка.саУНФ_ЗаказСнабжения")] = "ЗаполнитьПосаУНФ_ЗаказСнабжения";
	//***Конец***01.06.2021***МурашкоВ
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "ЗаказПокупателя");
	
	ЗаполнитьПодписиКладовщиков();
	
КонецПроцедуры

Процедура ЗаполнитьПосаУНФ_ЗаказСнабжения(ДокументСсылкаЗаказ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Ссылка КАК ЗаказСнабжения,
	|   ТаблицаДокумента.ДатаОтгрузки КАК Дата,
	|   ТаблицаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Вес КАК Вес,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаРеципиент КАК СтруктурнаяЕдиницаПолучатель,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаРеципиент КАК СтруктурнаяЕдиницаРеципиент,
	|	&ПредставлениеСсылки  КАК Комментарий,
	|	ТаблицаДокумента.Ячейка КАК ЯчейкаПолучатель,
	|	ТаблицаДокумента.ОжидаетсяВыборВариантаКП,
	|	ТаблицаДокумента.Грузоотправитель,
	|	ТаблицаДокумента.Грузополучатель,
	|	ТаблицаДокумента.АдресДоставки
	|ИЗ
	|	Документ.саУНФ_ЗаказСнабжения КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧастьЗапасы.Ссылка КАК ЗаказПокупателя,
	|	ТабличнаяЧастьЗапасы.НомерСтроки,
	|	ТабличнаяЧастьЗапасы.Номенклатура,
	|	ТабличнаяЧастьЗапасы.Характеристика,
	|	ТабличнаяЧастьЗапасы.Партия,
	|	ТабличнаяЧастьЗапасы.Вес,
	|	ТабличнаяЧастьЗапасы.ЕдиницаИзмерения,
	|	ТабличнаяЧастьЗапасы.Количество,
	|	ТабличнаяЧастьЗапасы.Содержание
	|ИЗ
	|	ВТЗаказПокупателяЗапасы КАК ТабличнаяЧастьЗапасы
	|ГДЕ
	|	ТабличнаяЧастьЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказ);
	Запрос.УстановитьПараметр("ПредставлениеСсылки","Введен на основании: " +СОКРЛП(Строка(ДокументСсылкаЗаказ)));
	Документы.саУНФ_ЗаказСнабжения.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(ДокументСсылкаЗаказ, Запрос.МенеджерВременныхТаблиц, Ложь);
	
	Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Ссылка КАК ДокументОснование", "&Ссылка КАК ЗаказПокупателя");
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапка = РезультатыЗапроса[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	ЭтотОбъект.Дата=НачалоДня(ЭтотОбъект.Дата)+8*60*60;
	ЭтотОбъект.ДатаОтгрузки = НачалоДня(ЭтотОбъект.Дата)+9*60*60;
	Запасы.Загрузить(РезультатыЗапроса[1].Выгрузить());
	
КонецПроцедуры


Функция ПриОтменеЗаказа()
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура КАК Номенклатура,
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура.Представление КАК НоменклатураПредставление ,
	|	СУММА(саУНФ_ЗаказСнабженияЗапасы.Количество) КАК Количество
	|ИЗ
	|	Документ.саУНФ_ЗаказСнабжения.Запасы КАК саУНФ_ЗаказСнабженияЗапасы
	|ГДЕ
	|	саУНФ_ЗаказСнабженияЗапасы.Ссылка = &СсылкаСнабжение
	|
	|СГРУППИРОВАТЬ ПО
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура,
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура.Представление";
	
	Запрос.УстановитьПараметр("ПеремещениеСсылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СсылкаСнабжение", ЭтотОбъект.Ссылка.ЗаказСнабжения);
	
	СоответсвиеНоменклатуры = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	саУНФ_АтозаказВызовСервера.ОчиститьНаборЗаписейВызовСервера(ЭтотОбъект.Ссылка.ЗаказСнабжения);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответсвиеНоменклатуры.Вставить(Выборка.НоменклатураПредставление,Выборка.Количество);
	КонецЦикла;
	Выборка.Сбросить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		саУНФ_АтозаказВызовСервера.ЗаписатьНаборЗаписейВызовСервера(РезультатЗапроса,ЭтотОбъект.Ссылка.ЗаказСнабжения,ЭтотОбъект.Автор); 
	КонецЕсли; 
	
	Возврат СоответсвиеНоменклатуры;
	
КонецФункции // ()



Функция ПроверитьВыполнениеЗаказа()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ПЕРЕМЕЩЕНИЕ
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &ПеремещениеСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеЗапасовЗапасы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура КАК Номенклатура,
	|	СУММА(саУНФ_ЗаказСнабженияЗапасы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_СНАБЖЕНИЕ
	|ИЗ
	|	Документ.саУНФ_ЗаказСнабжения.Запасы КАК саУНФ_ЗаказСнабженияЗапасы
	|ГДЕ
	|	саУНФ_ЗаказСнабженияЗапасы.Ссылка = &СсылкаСнабжение
	|
	|СГРУППИРОВАТЬ ПО
	|	саУНФ_ЗаказСнабженияЗапасы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СНАБЖЕНИЕ.Номенклатура КАК Номенклатура,
	|	ВТ_СНАБЖЕНИЕ.Количество - ЕСТЬNULL(ВТ_ПЕРЕМЕЩЕНИЕ.Количество, 0) КАК Количество,
	|	ВТ_СНАБЖЕНИЕ.Номенклатура.Представление КАК НоменклатураПредставление
	|ИЗ
	|	ВТ_СНАБЖЕНИЕ КАК ВТ_СНАБЖЕНИЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПЕРЕМЕЩЕНИЕ КАК ВТ_ПЕРЕМЕЩЕНИЕ
	|		ПО ВТ_СНАБЖЕНИЕ.Номенклатура = ВТ_ПЕРЕМЕЩЕНИЕ.Номенклатура
	|ГДЕ
	|	ВТ_СНАБЖЕНИЕ.Количество - ЕСТЬNULL(ВТ_ПЕРЕМЕЩЕНИЕ.Количество, 0) > 0";
	
	Запрос.УстановитьПараметр("ПеремещениеСсылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СсылкаСнабжение", ЭтотОбъект.Ссылка.ЗаказСнабжения);
	
	СоответсвиеНоменклатуры = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	саУНФ_АтозаказВызовСервера.ОчиститьНаборЗаписейВызовСервера(ЭтотОбъект.Ссылка.ЗаказСнабжения);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответсвиеНоменклатуры.Вставить(Выборка.НоменклатураПредставление,Выборка.Количество);
	КонецЦикла;
	Выборка.Сбросить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		саУНФ_АтозаказВызовСервера.ЗаписатьНаборЗаписейВызовСервера(РезультатЗапроса,ЭтотОбъект.Ссылка.ЗаказСнабжения,ЭтотОбъект.Автор); 
	КонецЕсли; 
	
	Возврат СоответсвиеНоменклатуры;
	
КонецФункции // ()

&Перед("ОбработкаПроведения")
Процедура саУНФ_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ЗаказСнабжения)  Тогда
		ЗаказКИсполнению 	= ЗаказСнабжения.ПолучитьОбъект();
		//Попытка
		ЗаказКИсполнению.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
		Заметки ="";
		СоответсвиеНоменклатуры = ПроверитьВыполнениеЗаказа();
		Если СоответсвиеНоменклатуры.Количество()>0 Тогда
			Для каждого СтрСоот Из СоответсвиеНоменклатуры  Цикл
				Заметки =	Заметки + "не поставлено: "+Символы.Таб +	СтрСоот.Ключ + +Символы.Таб + " количество: "	+  Строка(СтрСоот.Значение)+Символы.ВК;
			КонецЦикла; 
		Иначе
		КонецЕсли;
		ЗаказКИсполнению.Заметки = Заметки;
		
		ЗаказКИсполнению.ВариантЗавершения    =   Перечисления.ВариантыЗавершенияЗаказа.Успешно;
		ЗаказКИсполнению.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//КонецПопытки;
		
	КонецЕсли; 
	//саУНФ_Сумма    = 1000;
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура саУНФ_ОбработкаУдаленияПроведения(Отказ)
	Если ЗначениеЗаполнено(ЗаказСнабжения)  Тогда
		Если ЗаказСнабжения.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен
			И  ЗаказСнабжения.ВариантЗавершения    =   Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
			Возврат;		 
		КонецЕсли;
		//Попытка
		саУНФ_АтозаказВызовСервера.ОчиститьНаборЗаписейВызовСервера(ЗаказСнабжения);
		
		ЗаказКИсполнению 	= ЗаказСнабжения.ПолучитьОбъект();
		
		ЗаказКИсполнению.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.НайтиПоНаименованию("В работе");
		Заметки ="";
		ЗаказКИсполнению.Заметки = Заметки;
		
		ЗаказКИсполнению.ВариантЗавершения    =   Перечисления.ВариантыЗавершенияЗаказа.ПустаяСсылка();
		ЗаказКИсполнению.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//КонецПопытки;
		
	КонецЕсли; 
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
   	ТранзитныйСклад = Неопределено;
	СкладПинск =        Неопределено;
    Время =14;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек=Неопределено;
	ОМ = ОбщегоНазначения.ОбщийМодуль("саУНФ_РаботаСОМА");
	Если  НЕ ОМ =Неопределено Тогда
	
		     СтруктураНастроек=ОМ.ПолучитьСтруктураНастроекОМА();
	
	КонецЕсли; 
	
	Если Дата<Дата(2021,10,11) Тогда
	          ДатаОтгрузки = Дата;
	 КонецЕсли; 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	caУНФ_ТочкиДляАвтозаказа.Точка КАК Точка
	|ИЗ
	|	РегистрСведений.caУНФ_ТочкиДляАвтозаказа КАК caУНФ_ТочкиДляАвтозаказа
	|ГДЕ
	|	caУНФ_ТочкиДляАвтозаказа.Включить
	|	И caУНФ_ТочкиДляАвтозаказа.ЗапретПеремещения
	|	И caУНФ_ТочкиДляАвтозаказа.Точка = &СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если  ЗначениеЗаполнено(ЗаказСнабжения) Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	саУНФ_НастройкаАвтозаказа.Параметр КАК Параметр,
		|	саУНФ_НастройкаАвтозаказа.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.саУНФ_НастройкаАвтозаказа КАК саУНФ_НастройкаАвтозаказа";
	
	
	РезультатТС = Запрос.Выполнить();
	Если РезультатТС.Пустой() Тогда
		ТранзитныйСклад 	= 	Неопределено;
		СкладПинск 			=  Неопределено;
	Иначе
		ВыборкаТС = РезультатТС.Выбрать();
		СтруктураПоиска = Новый Структура("Параметр", "ТранзитныйСклад");
		Если ВыборкаТС.НайтиСледующий(СтруктураПоиска) Тогда
			ТранзитныйСклад = ВыборкаТС.Значение;			
		КонецЕсли; 
		
		ВыборкаТС.Сбросить();
		
		СтруктураПоиска = Новый Структура("Параметр", "СкладПинск");
		Если ВыборкаТС.НайтиСледующий(СтруктураПоиска) Тогда
			СкладПинск =ВыборкаТС.Значение; 		
		КонецЕсли; 
		
		
	КонецЕсли;
	
	 КонецЕсли;
	 
	 	
	Если ПривилегированныйРежим() Тогда
		     УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если  НЕ ТранзитныйСклад = Неопределено Тогда
	        Если СтруктурнаяЕдиницаПолучатель =  ТранзитныйСклад ИЛИ   СтруктурнаяЕдиница = ТранзитныйСклад Тогда
		             Если НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУНФ_ДоступКРучномуЗаказуПинскМинск") Тогда
						 Сообщение = Новый СообщениеПользователю;
						 Сообщение.Текст = "Из склада "+ТранзитныйСклад.Наименование+ " товар перемещать запрещено";
						 Сообщение.Сообщить();
						 Отказ = Истина;
					 КонецЕсли; 
	         КонецЕсли; 
	КонецЕсли; 
	
	//***Начало***08.02.2022***МурашкоВ
	Если НЕ СтруктураНастроек=Неопределено И НаправлениеДеятельности=СтруктураНастроек.Направление Тогда
	
	Иначе	
	
	 
	//***Конец***08.02.2022***МурашкоВ

	
	Если  НЕ РезультатЗапроса.Пустой() И НЕ саУНФ_ОбщийМодуль.ЕстьРоль("саУНФ_РазрешениеПеремещенияЗапасов") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Из РТТ "+СтруктурнаяЕдиница.Наименование+ " товар перемещать запрещено";
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЗаказСнабжения) И ЭтоНовый() Тогда
		Выборка =    саУНФ_АтозаказВызовСервера.ПолучитьПеремещения(СтруктурнаяЕдиницаПолучатель, СтруктурнаяЕдиница,Дата);
		Если  НЕ Выборка=Неопределено Тогда
			Сутки = 86400;
			КоличествоСуток=саУНФ_АтозаказВызовСервера.КоличествоСутокЗаказа(Дата);
			
			Если  НЕ СкладПинск = Неопределено Тогда
			
				  Если СтруктурнаяЕдиница   =    СкладПинск  Тогда
					        Время =11;
				  КонецЕсли; 
			КонецЕсли; 
			
			
			КрайняяДата = НачалоДня(Дата)-КоличествоСуток*Сутки + Время*60*60;
			Пока  Выборка.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Документ преремещения уже создан искусственным интелектом. Добавляйтсь сюда: "+Выборка.Представление+" (до "+Строка(КрайняяДата)+")";
				Сообщение.Сообщить();
			КонецЦикла; 
			Отказ = Истина;	 
		КонецЕсли; 
	КонецЕсли;
	
	//***Начало***08.02.2022***МурашкоВ
	 КонецЕсли;
	//***Конец***08.02.2022***МурашкоВ
	Если ЗначениеЗаполнено(ЗаказСнабжения)  И ПометкаУдаления Тогда
		ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен;
		СостояниеЗаказа 		= Справочники.СостоянияЗаказовПокупателей.Завершен;
		ПричинаОтменыЗаказа=саУНФ_АтозаказВызовСервера.ПричинаОтменыЗаказа();
		
		
		ЗаказКИсполнению 	= ЗаказСнабжения.ПолучитьОбъект();
		Попытка
			УстановитьПривилегированныйРежим(Истина);	
			ЗаказКИсполнению.СостояниеЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
			Заметки ="";
			СоответсвиеНоменклатуры = ПриОтменеЗаказа();
			Если СоответсвиеНоменклатуры.Количество()>0 Тогда
				Для каждого СтрСоот Из СоответсвиеНоменклатуры  Цикл
					Заметки =	Заметки + "не поставлено: "+Символы.Таб +	СтрСоот.Ключ + +Символы.Таб + " количество: "	+  Строка(СтрСоот.Значение)+Символы.ВК;
				КонецЦикла; 
			Иначе
			КонецЕсли;
			ЗаказКИсполнению.Заметки = Заметки;
			ЗаказКИсполнению.СостояниеЗаказа   			=      СостояниеЗаказа;
			Если ПричинаОтменыЗаказа<>Неопределено Тогда
				ЗаказКИсполнению.ПричинаОтмены    			=      ПричинаОтменыЗаказа;
			КонецЕсли; 
			
			ЗаказКИсполнению.ВариантЗавершения    =   ВариантЗавершения;
			ЗаказКИсполнению.Записать(РежимЗаписиДокумента.Проведение);
			Если ПривилегированныйРежим() Тогда
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			
		Исключение
			Описание = ОписаниеОшибки();
			саУНФ_АтозаказВызовСервера.ЗаписьОшибкиВЖурнал("Запись заказа снабжения",ЗаказКИсполнению.Ссылка,ЗаказКИсполнению.Ссылка,Описание);	
			Если ПривилегированныйРежим() Тогда
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЕсли;
	 Вес       =	0;
	 ОбщийОбъем   = 0;
	 Для каждого Запись Из ЭтотОбъект.Запасы  Цикл
		     Запись.Вес		=		?(Запись.Номенклатура.Вес>0, Запись.Номенклатура.Вес*Запись.Количество,Запись.Вес);
	         Вес       			=    	Вес+Запись.Вес;
			 ОбщийОбъем   =	   	ОбщийОбъем +Запись.Номенклатура.Объем*Запись.Количество;
	КонецЦикла; 		
	
	
	#Область РасчетСтоимости
		Вид_СтавкаНДС	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВидСтавкиНДСПоУмолчанию");
		Ставка_НДС			=  Справочники.СтавкиНДС.СтавкаНДС(Вид_СтавкаНДС, ЭтотОбъект.Дата);
		Ставка					= Ставка_НДС.Ставка;
		Если Ставка=Неопределено ИЛИ Ставка =0   Тогда
		         Ставка = 0.02;
		Иначе	
		         Ставка = Ставка / 100;
		КонецЕсли; 
		СтруктураПоВалютеУчета = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Валюта", Константы.ВалютаУчета.Получить()));
		Если СтруктураПоВалютеУчета.Свойство("Кратность") И НЕ СтруктураПоВалютеУчета.Кратность = Неопределено И НЕ  СтруктураПоВалютеУчета.Кратность =0 Тогда
			КурсНБРБ=СтруктураПоВалютеУчета.КурсНБРБ/СтруктураПоВалютеУчета.Кратность; 
		Иначе	
			КурсНБРБ = 1;
		КонецЕсли; 
		МВТ_1 =  Новый МенеджерВременныхТаблиц;
		Запрос = Новый Запрос;
        Запрос.МенеджерВременныхТаблиц = МВТ_1;

		
		Если ЭтоНовый() Тогда
			
			ТаблицаЗапасы=ЭтотОбъект.Запасы.Выгрузить();
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
			|	ТаблицаЗапасы.Партия КАК Партия,
			|	ТаблицаЗапасы.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТАБЛИЦАЗАПАСЫ
			|ИЗ
			|	&ТаблицаЗапасы КАК ТаблицаЗапасы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТАБЛИЦАЗАПАСЫ.Номенклатура КАК Номенклатура,
			|	СУММА(ВТ_ТАБЛИЦАЗАПАСЫ.Количество) КАК Количество,
			|	ВТ_ТАБЛИЦАЗАПАСЫ.Партия КАК Партия
			|ПОМЕСТИТЬ ВТ_ЗАПАСЫ
			|ИЗ
			|	ВТ_ТАБЛИЦАЗАПАСЫ КАК ВТ_ТАБЛИЦАЗАПАСЫ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТАБЛИЦАЗАПАСЫ.Номенклатура,
			|	ВТ_ТАБЛИЦАЗАПАСЫ.Партия";
			
			Запрос.УстановитьПараметр(	"ТаблицаЗапасы",ТаблицаЗапасы);
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
			|	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество,
			|	ПеремещениеЗапасовЗапасы.Партия КАК Партия
			|ПОМЕСТИТЬ ВТ_ЗАПАСЫ
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
			|ГДЕ
			|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПеремещениеЗапасовЗапасы.Номенклатура,
			|	ПеремещениеЗапасовЗапасы.Партия";
			
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ_1;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВТ_ЗАПАСЫ.Номенклатура КАК Номенклатура,
			|	ВТ_ЗАПАСЫ.Количество КАК Количество,
			|	ВТ_ЗАПАСЫ.Партия КАК Партия,
			|	&Организация КАК Организация,
			|	&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
			|ПОМЕСТИТЬ ВТ_НОМЕНКЛАТУРА
			|ИЗ
			|	ВТ_ЗАПАСЫ КАК ВТ_ЗАПАСЫ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_НОМЕНКЛАТУРА.Номенклатура КАК Номенклатура,
			|	ВТ_НОМЕНКЛАТУРА.Количество КАК Количество,
			|	ВТ_НОМЕНКЛАТУРА.Партия КАК Партия,
			|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
			|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
			|				ТОГДА ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) * ВТ_НОМЕНКЛАТУРА.Количество * &КурсНБРБ
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
			|					ТОГДА ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) * ВТ_НОМЕНКЛАТУРА.Количество * &КурсНБРБ
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 2))) * &Ставка КАК ЧИСЛО(15, 2)) КАК НДС,
			|	(ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
			|				ТОГДА ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) * ВТ_НОМЕНКЛАТУРА.Количество * &КурсНБРБ
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
			|					ТОГДА ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) * ВТ_НОМЕНКЛАТУРА.Количество * &КурсНБРБ
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ЧИСЛО(15, 2))) * &Ставка КАК ЧИСЛО(15, 2))) КАК СуммаСНДС
			|ИЗ
			|	ВТ_НОМЕНКЛАТУРА КАК ВТ_НОМЕНКЛАТУРА
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
			|				&ГраницаВремени,
			|				(Номенклатура, Партия, Организация, СтруктурнаяЕдиница) В
			|					(ВЫБРАТЬ
			|						ВТ_НОМЕНКЛАТУРА.Номенклатура КАК Номенклатура,
			|						ВТ_НОМЕНКЛАТУРА.Партия КАК Партия,
			|						ВТ_НОМЕНКЛАТУРА.Организация КАК Организация,
			|						ВТ_НОМЕНКЛАТУРА.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
			|					ИЗ
			|						ВТ_НОМЕНКЛАТУРА КАК ВТ_НОМЕНКЛАТУРА)) КАК ЗапасыОстатки
			|		ПО ВТ_НОМЕНКЛАТУРА.Номенклатура = ЗапасыОстатки.Номенклатура
			|			И ВТ_НОМЕНКЛАТУРА.Партия = ЗапасыОстатки.Партия
			|			И ВТ_НОМЕНКЛАТУРА.Организация = ЗапасыОстатки.Организация
			|			И ВТ_НОМЕНКЛАТУРА.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
			|ИТОГИ
			|	СУММА(Сумма),
			|	СУММА(НДС),
			|	СУММА(СуммаСНДС)
			|ПО
			|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ГраницаВремени", Новый Граница(ЭтотОбъект.МоментВремени(),ВидГраницы.Исключая));
    Запрос.УстановитьПараметр("Ставка", Ставка);
	Запрос.УстановитьПараметр("КурсНБРБ", КурсНБРБ);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ЭтотОбъект.СтруктурнаяЕдиница);
	РезультатЗапроса = Запрос.Выполнить();
	Если  НЕ РезультатЗапроса.Пустой() Тогда
	        Выборка = РезультатЗапроса.Выбрать();
		    Выборка.Следующий();
	        саУНФ_Сумма       		=	Выборка.Сумма;		
			саУНФ_СтавкаНДС 		= 	Ставка_НДС;
			саУНФ_НДС             	=	Выборка.НДС;
			саУНФ_СуммаСНДС 	=  Выборка.СуммаСНДС;
	КонецЕсли; 
	
	#КонецОбласти	    	
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура саУНФ_ПриЗаписи(Отказ)
	
		   
	

КонецПроцедуры

&После("ПриКопировании")
Процедура саУНФ_ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ПАК_МаршрутныйЛист = Документы.ПАК_МаршрутныйЛист.ПустаяСсылка();
	ЭтотОбъект.ДатаОтгрузки  = Дата(1,1,1);
	ЭтотОбъект.ЗаказСнабжения  = Документы.саУНФ_ЗаказСнабжения.ПустаяСсылка();
	ЭтотОбъект.ОбщийОбъем  = 0;
	ЭтотОбъект.саУНФ_Сумма  = 0;
	ЭтотОбъект.саУНФ_НДС     = 0;
	ЭтотОбъект.саУНФ_СуммаСНДС =0;
	ЭтотОбъект.ТелефонКурьера  = 0;
	ЭтотОбъект.СостояниеСборки = Перечисления.СостояниеСборки.НеСобран;
	ЭтотОбъект.ДатаЗагрузкиАвтомобиля  = Дата(1,1,1);
	ЭтотОбъект.Доставлен   = 0;
	ЭтотОбъект.ФИОВодителя = "";
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура саУНФ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Дата<Дата(2021,10,11) Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ДатаОтгрузки");
		Если НЕ Индекс = Неопределено  Тогда
		      ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
